Repository: DreamedWorker/TravellersBag
Catalog: TravellersBag/Localizable.xcstrings
Source language: zh_hans
Languages: en

# account.alert.logout
source: 确定要退出登录？
en: Are you sure to log out?

# account.alert.logoutM
source: 退出登录将删除本账号的信息，你将无法查看「祈愿记录」等与账号密切相关的页面，但相应的数据不会被删除。如果这是唯一的账号，退出账号后应用会自动关闭以应用更改！
en: Log out will delete the information of this account, and you will not be able to view pages closely related to the account, such as “Gacha Records", but the corresponding data will not be deleted. If this is the only account, the application will automatically close after logging out to make changes!

# account.cookie.input
source: 键入Cookie
en: Type Cookie

# account.cookie.tip
source: 你的Cookie应当包含stuid、stoken和mid。
en: Your cookie should contain stuid, stoken and mid.

# account.detail.connect
source: 检查状态
en: Check state

# account.detail.copy_cookie
source: 复制Cookie
en: Copy as cookie

# account.detail.def_account
source: 设为默认
en: Set as default

# account.detail.genshin_level
source: 冒险等阶
en: Level

# account.detail.genshin_name
source: 游戏昵称
en: Nicname

# account.detail.logout
source: 退出登录
en: Log out

# account.detail.shequ_uid
source: 通行证ID
en: Passport ID

# account.error.cannot_copy_hk4e_detail
source: 无法获取原神基本数据，该通行证可能并未绑定任何游戏账号。
en: Unable to obtain the basic data of Genshin Impact, the pass may not be bound to any game account.

# account.error.createQR
source: 生成二维码时遇到未知错误。
en: Unknown error encountered while generating QR code.

# account.error.emptyFromQr
source: 二维码为空。
en: The QR code is empty.

# account.error.emptyFromServer
source: 服务器返回数据为空或结构异常。
en: The server returned empty or structurally abnormal data.

# account.error.incorrentCookie
source: Cookie格式有误。
en: The cookie format is incorrect.

# account.error.prepare
source: 准备二维码时出现错误：%@
en: An error occurred while preparing the QR code:%@

# account.error.same
source: 账号已存在，不得反复添加。
en: The account already exists and cannot be added repeatedly.

# account.error.setDef
source: 该账号已经是默认账号了！
en: This account is already the default account!

# account.error.update
source: 我们无法自动更新你的账号，请退出登录后重新登录。
en: We are unable to automatically update your account. Please log out and log in again.

# account.info.noUpdate
source: 你的账号状态正常，无需更新。
en: Your account status is normal and does not need to be updated.

# account.info.reDef
source: 已退出当前账号并将列表的第一项用作默认。
en: I have logged out of the current account and used the first item on the list as the default.

# account.info.updated
source: 我们刚刚更新了你的账号信息。
en: We have just updated your account information.

# account.nothing.title
source: 请先选择账号…
en: Please select an account first

# account.qr.refresh
source: 刷新二维码
en: Refresh

# account.qr.tip
source: 请使用「米游社」App扫码（扫码并不会使你登录游戏，亦不会导致游戏账号的创建。），并在扫描完成后按下确认按钮。
en: Please use the “米游社” app to scan the code (scanning the code will not log you in to the game, nor will it result in the creation of a game account), and press the confirm button after scanning is complete.

# account.side.loginByCookie
source: Cookie登录
en: By Cookie

# account.side.loginByQr
source: 二维码登录
en: By QR Code

# app.command.hutao
source: 胡桃通行证…
en: Hutao Passport

# app.name
source: 旅者行囊
en: TravellersBag

# app.no
source: 否
en: No

# app.yes
source: 是
en: Yes

# avatar.constellation.active
source: 已激活
en: Actived

# avatar.detail.no_avatar
source: 从云端获取的数据中没有这个角色的信息，请刷新数据。
en: There is no information about this role in the data obtained from the cloud. Please refresh the data.

# avatar.display.affix_level
source: 精炼%@阶
en: Affix level: %@

# avatar.display.detail
source: 点按天赋、命座或装备图标查看详细信息
en: Click to see more about skill, etc.

# avatar.display.fetter
source: 好感度：%@
en: Fetter: %@

# avatar.display.prop
source: 角色信息
en: Avatar info

# avatar.display.select
source: 请先选择一个角色…
en: Select an avatar first

# avatar.empty.fetch
source: 从战绩面板提取
en: Fetch from official

# avatar.empty.title
source: 暂无本地角色数据…
en: No local data available at the moment

# avatar.error.fetch
source: 获取数据时失败，%@。
en: Failed to retrieve data, %@.

# avatar.error.fetch_unknown
source: 出现了未知问题，请稍后重试。
en: An unknown issue has occurred, please try again later.

# avatar.info.fetch_ok
source: 获取数据成功。
en: Successfully obtained data.

# avatar.skill.info
source: 天赋信息
en: Skill info

# avatar.weapon.main_prop
source: 主词条
en: Main-word

# avatar.weapon.sub_prop
source: 副词条
en: Sub-word

# daily.abnormal.delete
source: 删除便签
en: Delete

# daily.abnormal.title
source: 此便签无法查看
en: This note can not be load

# daily.add.fetch
source: 添加
en: Add

# daily.add.title
source: 从列表中选取账号
en: Select an account

# daily.display.coin
source: 洞天宝钱
en: Coin

# daily.display.coin_off
source: 洞天财瓮已经储满
en: Coin storage is full.

# daily.display.coin_on
source: 预计%@后达到存储上限
en: Expected to reach storage limit after %@

# daily.display.expedition
source: 探索派遣
en: Expedition

# daily.display.expedition_off
source: 探索完成
en: Finished

# daily.display.expedition_on
source: 还剩%@
en: Remains %@

# daily.display.mainline
source: 魔神任务
en: Task

# daily.display.mainline_off
source: 全部完成
en: Finished

# daily.display.mainline_on
source: 进行中
en: Ongoing

# daily.display.refreshTip
source: 请勿频繁刷新。
en: Do not refresh frequently.

# daily.display.resin
source: 原粹树脂
en: Resin

# daily.display.resin_discount
source: 值得铭记的强敌
en: Formidable Enemy

# daily.display.resin_discount_p
source: 本周剩余周本消耗减半
en: Remains

# daily.display.resin_off
source: 树脂已满
en: Resin is full

# daily.display.resin_on
source: 将于%@后全部恢复
en: All will be restored after %@

# daily.display.stored_attendance
source: 长效历练点：%@
en: Stored attendance: %@

# daily.display.task
source: 每日委托
en: Daily tasks

# daily.display.transformer
source: 参量质变仪
en: Transformer

# daily.display.transformer_off
source: 已准备完成
en: Ready

# daily.display.transformer_on
source: 还需要%@天%@小时%@分钟完成准备
en: It still needs %@ days %@ hours %@ minutes to complete the preparation.

# daily.empty
source: 便筹容器为空…
en: Empty…

# daily.empty.createFromDef
source: 从默认账号创建
en: Create from default account

# daily.error.existed
source: 所选账号已经存在，请更新而不是重复添加。
en: The selected account already exists, please update instead of adding it again.

# daily.error.needDefaultAccountFirst
source: 请先选择一个默认账号或先登录后再继续。
en: Please choose a default account first or log in before continuing.

# daily.error.updateUnknown
source: 出现未知错误而无法更新，请删除这个便签。
en: An unknown error has occurred and cannot be updated. Please delete this note.

# daily.no_account.title
source: 请先设定默认账号！
en: Please set the default account first!

# dashboard.detail.achievement_number
source: 获得成就数
en: Achievements

# dashboard.detail.active_day_number
source: 活跃天数
en: Active Days

# dashboard.detail.anemoculus_number
source: 风神瞳
en: Anemoculus

# dashboard.detail.avatarNumber
source: 获得角色数
en: Avatars

# dashboard.detail.dendroculus_number
source: 草神瞳
en: Dendroculus

# dashboard.detail.domain_number
source: 解锁秘境数
en: Domains

# dashboard.detail.electroculus_number
source: 雷神瞳
en: Electroculus

# dashboard.detail.full_fetter_avatar_num
source: 满好感角色
en: Full Fetter Avatars

# dashboard.detail.geoculus_number
source: 岩神瞳
en: Geoculus

# dashboard.detail.house.comfort
source: 最高洞天仙力
en: Max comfort

# dashboard.detail.house.items
source: 获得摆设数
en: Items

# dashboard.detail.house.level
source: 信任等阶
en: Level

# dashboard.detail.house.visit
source: 历史访客数
en: Visits

# dashboard.detail.hydroculus_number
source: 水神瞳
en: Hydroculus

# dashboard.detail.luxurious_chest_number
source: 华丽宝箱数
en: Luxurious chests

# dashboard.detail.pyroculus_number
source: 火神瞳
en: Pyroculus

# dashboard.detail.role_combat
source: 幻想真境剧诗演出幕
en: Role Combat Rounds

# dashboard.detail.way_point_number
source: 解锁传送点
en: Way Points

# dashboard.empty
source: 暂无数据，请更新…
en: Nothing to show, please update…

# dashboard.error.fetch
source: 无法从服务器获取战绩信息，%@
en: Cannot fetch anything from server, %@

# dashboard.fetch
source: 获取信息
en: Fetch

# dashboard.info.baseSpiralAbyss
source: 深境螺旋
en: Spiral Abyss

# dashboard.info.baseTitle
source: 基本信息
en: Basic Info

# dashboard.info.houseTitle
source: 尘歌壶
en: Houses

# dashboard.info.worldTitle
source: 世界探索度
en: World Exploration

# dashboard.menu.another
source: 查看其他账号
en: View other accounts

# dashboard.more.choose
source: 选择
en: Select

# dashboard.more.description
source: 请从下方列表中选择要查看信息的通行证（注意确保这个通行证绑定了原神角色）
en: Please select the pass to view the information from the list below (note that this pass is bound to the role of Genshin Impact)

# dashboard.more.title
source: 选择查看其他账号
en: Choose to view other accounts

# dashboard.unit.world.boss
source: 区域首领
en: Bosses

# dashboard.unit.world.boss_kill
source: %@次击败
en: Defeat %@ times

# dashboard.unit.world.ee
source: 探索度
en: Exp

# dashboard.unit.world.ee.sub
source: 子区域探索度：
en: Sub-area exp

# dashboard.unit.world.level
source: 声望等级：%@
en: Reputation: Lv.%@

# dashboard.unit.world.offering
source: %@等级：%@
en: %@ Level. %@

# dashboard.unit.world.statue
source: 七天神像等级：%@
en: The Seven statue Lv. %@

# dashboard.waiting
source: 请先登录或等待信息获取完成…
en: Please log in first or wait for information retrieval to complete…

# def.cancel
source: 取消
en: Cancel

# def.checkForUpdate
source: 检查更新…
en: Check for updates…

# def.confirm
source: 确认
en: Confirm

# def.error.updateFP
source: 更新设备指纹时出现错误，请重试。
en: An error occurred while updating the device fingerprint. Please try again.

# def.holding
source: 请等待先决操作完成…
en: Please wait for the prerequisite operation to complete…

# def.operationErrorOccured
source: 出现错误：%@
en: Error Occurred: %@

# def.operationSuccessful
source: 操作成功！
en: Operation Successful

# def.refresh
source: 刷新
en: Refresh

# gacha.def.select
source: 查看
en: View

# gacha.def.title
source: 请先选择一个账号以查看
en: Select an account first to view

# gacha.def.waiting
source: 我们正在获取存储于官方的你的全部祈愿记录，这将持续一段时间，期间请保持网络通畅，并请不要关闭本程序或按下键盘上的「esc」按键以确保程序运行正常。
en: We are retrieving all of your records stored on the official website, which will continue for a period of time. Please keep the network open during this time and do not close this program or press the "ESC" button on the keyboard to ensure that the program runs properly.

# gacha.empty.fetch
source: 从官方获取
en: Fetch from official web

# gacha.empty.title
source: 该账号暂无本地数据
en: This account currently has no local data available

# gacha.error.sync
source: 无法从云端同步，%@
en: Unable to synchronize from the cloud,%@

# gacha.error.syncPool
source: 在同步%@时出现问题。
en: There was a problem synchronizing %@.

# gacha.history
source: 祈愿版本历史
en: Activity history

# gacha.history.five
source: 五星角色（武器）
en: 5-star item(s)

# gacha.history.four
source: 四星角色（武器）
en: 4-star item(s)

# gacha.history.other
source: 其他角色（武器）
en: other items

# gacha.history.refresh
source: 刷新历史记录
en: Refresh

# gacha.history.select
source: 请先选择要查看的卡池
en: Please select the activity you want to view first

# gacha.history.uniqueUpdate
source: 请在设置页面统一更新全部的文本资源和图片资源。
en: Please update all text and image resources uniformly on the settings page.

# gacha.history.version
source: 版本
en: Version

# gacha.home.avatar
source: 角色活动祈愿
en: Avatar

# gacha.home.collection
source: 集录祈愿
en: Collection

# gacha.home.resident
source: 奔行世间
en: Resident

# gacha.home.weapon
source: 神器铸形
en: Weapon

# gacha.overview.count
source: %@ 抽
en: %@ times

# gacha.overview.last_five
source: 上个五星
en: Last 5 stars

# gacha.overview.last_four
source: 上个四星
en: Last 4 stars

# gacha.overview.no_record
source: 没有记录
en: No records

# gacha.overview.time
source: 记录时间：%@ — %@
en: Time: %@ - %@

# gacha.overview.total
source: 总计数
en: Total

# home.sidebar.account
source: 账号管理
en: Accounts

# home.sidebar.adopt
source: 养成计算器
en: Adopt calculator

# home.sidebar.avatar
source: 我的角色
en: Avatars

# home.sidebar.dashboard
source: 仪表盘
en: Dashboard

# home.sidebar.gacha
source: 祈愿记录
en: Gacha records

# home.sidebar.note
source: 实时便筹
en: Daily note

# home.sidebar.notice
source: 通知公告
en: Announcement

# home.sidebar.shequ
source: 战绩面板
en: Record panel

# home.sidePart.functional
source: 功能
en: Functions

# home.sidePart.normal
source: 通用
en: General

# home.sidePart.web
source: 网页
en: Web

# hutao.error.crypto
source: 无法加密内容
en: Unable to encrypt content

# hutao.error.deleteRecord
source: 删除失败，%@
en: Failed to delete, %@

# hutao.error.fetch_gacha_info
source: 无法获取云端祈愿信息，%@。
en: Unable to obtain cloud prayer information,%@.

# hutao.error.login
source: 无法登录你的通行证：%@
en: Cannot log in, %@

# hutao.error.sync
source: 无法从胡桃云同步数据，因为：%@
en: Unable to synchronize data from Hutao Cloud because:%@

# hutao.error.upload
source: 上传失败，%@
en: Failed to upload, %@

# hutao.ExpireAt
source: 服务到期时间
en: Expire at:

# hutao.gacga.deleteDialog
source: 要删除这条祈愿记录吗？
en: Do you want to delete this record?

# hutao.gacga.deleteDialogP
source: 这项操作不可逆，请确认你知道你正在做什么。建议在删除之前在本地做好备份避免数据无法找回。
en: This operation is irreversible, please confirm that you know what you are doing. It is recommended to make a backup locally before deleting to avoid data being unrecoverable.

# hutao.gacha.count
source: %@抽
en: %@ times

# hutao.gacha.delete
source: 删除该记录
en: Delete

# hutao.gacha.sync
source: 更新记录信息
en: Update

# hutao.gacha.sync_with_cloud
source: 从胡桃云同步记录信息
en: Sync

# hutao.gacha.upload
source: 上传记录
en: Upload

# hutao.info.recordDeleted
source: 删除操作执行成功。
en: The deletion operation was successfully executed.

# hutao.info.syncOK
source: 已经从胡桃云为%@同步了%@条记录。
en: %@ records have been synchronized from Hutao Cloud for %@.

# hutao.info.uploadOK
source: 完成上传任务
en: Task finished.

# hutao.login
source: 登录胡桃通行证
en: Login Hutao Passport

# hutao.login.email
source: 邮箱
en: Email

# hutao.login.password
source: 密码
en: Password

# hutao.loginP
source: 登录到你的胡桃通行证以访问胡桃云的有关服务。
en: Log in to your Hutao Pass to access the relevant services of Hutao Cloud.

# hutao.loginP2
source: 在登录之前请确保你已经阅读并同意胡桃云的服务协议。
en: Please ensure that you have read and agreed to the service agreement of Hutao Cloud before logging in.

# hutao.title
source: 欢迎你，%@。
en: Welcome, %@.

# notice.def.retry
source: 重试
en: Retry

# notice.def.subtitle
source: 这将很快完成（取决与你的网络连接情况），如果长时间停留在本页面或者出现错误弹窗，请检查情况后点按下方的重试按钮。
en: This will be completed quickly (depending on your network connection). If you stay on this page for a long time or encounter error pop ups, please check the situation and click the retry button below.

# notice.def.title
source: 正在获取通知公告…
en: Getting announcements

# notice.error.empty
source: 服务器返回空值！
en: The server returned a null value!

# notice.main.current_gacha
source: 当期祈愿
en: Current gacha

# notice.main.gacha_time
source: 起止日期
en: Time

# notice.main.gacha_time_p
source: 从%@到%@
en: From %@ to %@

# traveller.name
source: 旅行者
en: Traveller

# wizard.final.description
source: 再进行一些细微的调整，你就将完成初始化设置。
en: By making some minor adjustments, you will complete the initialization settings.

# wizard.final.finish
source: 完成
en: Finish

# wizard.final.noticeCheck
source: 授权
en: Grant

# wizard.final.notification
source: 授权通知权限
en: Notification permission

# wizard.final.notificationTip
source: 通知权限允许我们通过系统统一的通知中心向你发出一些信息提示，如操作完成状况、游戏内状态等。
en: Notification permission allows us to send you some information prompts through the system's unified notification center, such as operation completion status, in-game status, etc.

# wizard.final.tip
source: 至此，全部预设置已经完成，点按「完成」按钮后应用会自动重启使设置生效。
en: At this point, all pre settings have been completed. After clicking the "Finish" button, the application will automatically restart for the settings to take effect.

# wizard.final.title
source: 大功告成
en: Accomplishment

# wizard.lang.apply
source: 应用更改
en: Apply

# wizard.lang.choose
source: 选择一种语言
en: Choose your language

# wizard.lang.description
source: 旅者行囊将根据你的操作系统语言自动设置显示语言以与你的系统语言匹配。在当前的翻译情况下，如果你的操作系统显示的是简体中文与English以外的语言文字，那么将显示简体中文。
en: We will automatically set the display language based on your operating system language to match your system language. In the current translation situation, if your operating system displays language text other than 简体中文 and English, then 简体中文 will be displayed.

# wizard.lang.next
source: 下一步
en: Next

# wizard.lang.tip
source: 重新调整语言后需要你手动重启应用程序以使更改被应用。
en: After readjusting the language, you will need to manually restart the application for the changes to be applied.

# wizard.lang.title
source: 选择你的显示语言
en: Choose Display Text

# wizard.license.description
source: 下列的若干文件是用于约束你与我们的行为的重要文件，它们将告诉你应当在何种范围内使用本软件、你与我们都各有哪些权利与义务以及你如何与我们通过Issues沟通等。
en: The following documents are important documents used to constrain your behavior with us. They will tell you within what scope you should use this software, what rights and obligations each of us has, and how you can communicate with us through “Issues”.

# wizard.license.read
source: 我已经充分阅读、理解并同意:
en: I have fully read, understood, and agree to:

# wizard.license.tip
source: 你应当在阅读完并同意上述全部文件后再继续。
en: You should read and agree to all the above documents before continuing.

# wizard.license.title
source: 旅者行囊 规范性文件
en: Normative documents

# wizard.license.typeInfoCollection
source: 《用户信息收集声明》
en: “User Information Collection Statement”

# wizard.license.typeIssue
source: 关于Github仓库Issues的使用方法
en: “How to use Github repository issues”

# wizard.license.typeOpenSource
source: 《开放源代码许可（GNU GPL v3.0）》
en: “Open Source License (GNU GPL v3.0)”

# wizard.license.typeUser
source: 《用户服务协议》
en: “User Service Agreement”

# wizard.res.description
source: 这里将允许你选择每次加载图片和部分文字资源时的数据来源。我们为你内置了一份随附资源（包含角色、武器和圣遗物信息，但它们可能已经过时了）
en: This will allow you to choose the data source for each loading of images and partial text resources. We have built-in a set of accompanying resources for you (including character, weapon, and relic information, but they may be outdated)

# wizard.res.download
source: 下载
en: Download

# wizard.res.errorNotExist
source: 你还未下载资源，无法索引！
en: You haven't downloaded the resources yet, so we can't index them!

# wizard.res.errorNotFull
source: 你下载的资源不完整，请重新下载。
en: The resources you downloaded are incomplete, please download again.

# wizard.res.imageSee
source: 滑动鼠标查看所有可下载的图像资产。（全部下载在解压后将占用大约200MB的磁盘空间）
en: Slide the mouse to view all downloadable image assets. (All downloads will occupy approximately 200MB of disk space after decompression)

# wizard.res.imageTitle
source: 图像类资产
en: Images

# wizard.res.index
source: 索引资产
en: Index

# wizard.res.sheetJsonStatus
source: 正在下载第%@个文件，总共%@个文件。请在此过程中不要关闭本弹窗或本程序。
en: Downloading the %@ th file, out of a total of %@ files. Please do not close this pop-up sheet or program during this process.

# wizard.res.sheetJsonTitle
source: 我们正在下载资产…
en: We are now downloading…

# wizard.res.staticBeforeDl
source: 下载前检查
en: Check before download

# wizard.res.staticExplanation
source: 这些资源包含角色信息（名字、元素力、天赋、命座等）、武器信息（名字、词条等）、圣遗物信息（词条、套装信息）、历史祈愿活动、游戏成就词条等与软件基础功能密切相关的内容。如果你选择下载新资产，则必须要完成下载和「资源索引」后才能继续，否则程序后续将无法运行。
en: These resources include character information (name, element, talent, etc.), weapon information (name, entry, etc.), relic information (entry, set information), historical gacha activities, game achievement entries, and other content closely related to the basic functions of the software. If you choose to download a new asset, you must complete the download and ‘Inde’x before continuing, otherwise the program will not run in the future.

# wizard.res.staticTitle
source: 文本类资产*
en: Text*

# wizard.res.tip
source: 如果在什么都不做的情况下直接下一步将全部使用「在线获取」的方式获取图像类资产并使用内嵌的文本类资产（你可以在之后更新它们）。你所下载的这些资源来自DGP Studio的整理。
en: If you don't do anything, the next step is to use the "online acquisition" method to obtain all image assets and use embedded text assets (you can update them later). The resources you downloaded are collected by DGP Studio.

# wizard.res.title
source: 资源使用策略
en: Resource utilization strategy

# wizard.wave.description
source: 旅者行囊是一款专为现代macOS设计的，基于GPLv3.0协议开源的，旨在改善Mac用户的原神游戏外体验的工具集软件。 请遵循我们接下来的配置，然后你就可以在Mac上继续「游历」提瓦特大陆了！
en: TravelersBag is a tool set software designed for modern macOS, open source based on GPLv3.0 protocol, and designed to improve Mac users' Genshin Impact out-of-game experience. Please follow our next configuration, and then you can continue to 'explore' the continent of open-world on Mac!

# wizard.wave.go
source: 开始
en: Start

# wizard.wave.title
source: 欢迎使用旅者行囊
en: Welcome to use TravellersBag
